title: Tor Client/Browser Execution
id: 62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
status: test
description: Detects the use of Tor or Tor-Browser to connect to onion routing networks including Brave Browser's Private Window With TOR feature
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
author: frack113, wololo7
date: 2022/02/20
modified: 2023/11/14
tags:
    - attack.command_and_control
    - attack.t1090.003
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\tor.exe'
            - '\Tor Browser\Browser\firefox.exe'
            - '*\AppData\Local\BraveSoftware\Brave-Browser\User Data\*\*\tor-*-win32-brave-*'
    condition: selection
falsepositives:
    - Unknown
level: high
